{
  "_name_or_path": "jaketae/hifigan-lj-v1",
  "architectures": [
    "HiFiGAN"
  ],
  "auto_map": {
    "AutoConfig": "configuration_hifigan.HiFiGANConfig",
    "AutoModel": "modeling_hifigan.HiFiGAN"
  },
  "model_in_dim": 80,
  "model_type": "hifigan",
  "resblock_dilation_sizes": [
    [
      1,
      3,
      5
    ],
    [
      1,
      3,
      5
    ],
    [
      1,
      3,
      5
    ]
  ],
  "resblock_kernel_sizes": [
    3,
    7,
    11
  ],
  "sampling_rate": 22050,
  "torch_dtype": "float32",
  "transformers_version": "4.18.0",
  "upsample_initial_channel": 512,
  "upsample_kernel_sizes": [
    16,
    16,
    4,
    4
  ],
  "upsample_rates": [
    8,
    8,
    2,
    2
  ]
}
